# SelfIntersectingSpline Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CurveFailures..::..SelfIntersectingSpline Property
BuiltInFailures..::..CurveFailures Class See Also
---
Self intersecting splines are not allowed in sketches.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId SelfIntersectingSpline { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SelfIntersectingSpline As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ SelfIntersectingSpline {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CurveFailures Class
Autodesk.Revit.DB Namespace